# 流水所有参数

# 一.正则匹配格式
# 交易日期或者时间关键字
TRANS_TIME_PATTERN = r'(?<!记账)(日期|时间|交易日|账务日|[Tt]ime)'
# 记账日期或者时间关键字
ACCOUNTING_DATE_PATTERN = r'(?<=记账)(日期|时间|交易日|账务日|[Tt]ime)'
# 交易金额关键字
TRANS_AMT_PATTERN = \
    r"(收支|转入|转出|金额|发生额|支出|存入|收入|Debit(?!A)|Credit|记账方向|支取|出账|进账|取出|借|贷|汇出|汇入|交易类型)"
# 交易余额关键字
TRANS_BAL_PATTERN = r'(余额|[Bb]alance)'
# 交易对手关键字
TRANS_OPNAME_PATTERN = r"(?<!本.)(户名|方名称|姓名|单位名称|对方单位|公司名|对手名称|人名称|账号名称)"
# 币种关键字
TRANS_CUR_PATTERN = r'(币种|货币|[Cc]urrency)'
# 交易对手姓名关键字
TRANS_OPACCT_PATTERN = r'(?<!本.)(账号(?!名称)|账户(?!名称|明细|省市)|ID|户口号)'
# 交易对手开户行关键字
TRANS_OPBANK_PATTERN = r'(?<!本.)((?<!交易)行名|开户行|开户机构|开户网点|银行名称|银行)'
# 交易渠道关键字
TRANS_CHANNEL_PATTERN = r'(渠道|交易行|受理机构|交易网点|交易机构)'
# 交易方式关键字
TRANS_TYP_PATTERN = r'(方式|业务类型|[Tt]ype|业务类别|现转)'
# 交易用途关键字
TRANS_USE_PATTERN = r'(用途)'
# 交易备注关键字
TRANS_REMARK_PATTERN = r'(摘要|说明|附言|备注|[Dd]escription|个性化信息|其他|其它|对方信息)'

# 标准日期时间格式
#   时间+日期格式,年份20开头,00-29结尾,即2000年到2029年,月份01-12,日期01-31(暂时不区分大小月),小时00-23,分钟00-59
#   秒钟00-59,或者excel表示的日期,即40000-49999之间的数字(可以包含小数部分)
DTTIME_PATTERN = r"^20[012]\d(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])([01]\d|2[0-3])([0-5]\d){2}|^4\d{4}\d*[1-9]+\d*"
# 标准日期格式
#   日期格式,仅有年份,月份,日期,含义同上
DATE_PATTERN = r'^20[012]\d(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])|^4\d{4}'
# 标准时间格式
#   小时00-23,分钟00-59,秒钟00-59
TIME_PATTERN = r'^([01]\d|2[0-3])([0-5]\d){2}$|0\d*[1-9]+\d*'
# 短日期格式
#   小时00-23,分钟00-59
TIME_S_PATTERN = r'^([01]\d|2[0-3])[0-5]\d$'

# 金额格式
#   金额格式,以非0数字开头的整数,或者以0开头的小数
AMT_PATTERN = r'^[1-9]\d*|0\d*[1-9]+\d*'
# 忽略的格式
#   一旦某行包含下列关键字，大概率是统计性信息，需要将整行删除
IGNORE_PATTERN = r'.*(合计|累计|总计|总笔数|总额|记录数|参考|承前).*'

# 进账关键字
INCOME_PATTERN = r'[收入存贷进来]|Credit'
# 出账关键字
OUTCOME_PATTERN = r'[支出取借付往]|Debit'
# 出账全匹配
OUTCOME_FULL_PATTERN = r'.*[借出支往取付].*'

# 二.返回信息枚举
# resp_mapping = {
#     '01': {
#         "resCode": "1",
#         "resMsg": "失败",
#         "data": {
#             "warningMsg": ['上传文件类型错误,仅支持csv,xls,xlsx格式文件']}
#     },
#     '02': {
#         "resCode": "1",
#         "resMsg": "失败",
#         "data": {
#             "warningMsg": ['上传文件类型错误,仅支持csv,xls,xlsx格式文件']}
#     }
# }


# 三.所有数字配置

# 标题行最大匹配行数
MAX_TITLE_NUMBER = 30
# 最小交易间隔
MIN_TRANS_INTERVAL = 160
# 最小查询间隔
MIN_QUERY_INTERVAL = 180
# 最小导入间隔
MIN_IMPORT_INTERVAL = 45

# 结息日均利率计算参数,不能为0
INTEREST_MULTIPLIER = 0.0035

# 异常交易金额
UNUSUAL_TRANS_AMT = [
    5.20, 5.21, 13.14, 14.13, 20.20, 20.13, 20.14, 131.4, 201.3, 201.4, 520, 520.20, 521, 1314, 1314.2, 1413,
    1413.2, 2013.14, 2014.13, 201314, 2020.2, 202020.2, 13145.2, 1314520, 52013.14, 5201314]
# 家庭不稳定交易密度阈值
UNSTABLE_DENSITY = 0.3

# 最小民间借贷金额
# MIN_PRIVATE_LENDING = 500
# 最小民间借贷持续月份数
# MIN_CONTI_MONTHS = 6
# 最大民间借贷日期差别
# MAX_INTERVAL_DAYS = 5

# 多久内导入的流水视为同一笔业务的流水
MONTH_LIMIT = 2

# 四.二进制类型枚举
# csv文件分隔符类型枚举值
CSV_DELIMITER = [',', ';', '|', '\t', ':']
# csv文件编码格式
CSV_ENCODING = ['utf-8', 'gbk', 'gb2312', 'gb18030', 'cp936', 'big5']

# 强关联关系
STRONGER_RELATIONSHIP = ['U_PERSONAL',
                         'U_PER_LG_COMPANY',
                         'U_PER_SH_H_COMPANY',
                         'U_PER_SH_M_PERSONAL',
                         'U_PER_SP_PERSONAL',
                         'U_PER_SP_LG_COMPANY',
                         'U_PER_SP_SH_H_COMPANY',
                         'U_PER_SP_SH_H_COMPANY',
                         'U_PER_CT_COMPANY',
                         'U_PER_SP_CT_COMPANY',
                         'U_PER_PARENTS_PERSONAL',
                         'U_PER_CHILDREN_PERSONAL']
# 交易对手剔除以下单位：
# UNUSUAL_OPPO_NAME = ['对私|跨行|淘宝|转账|转存|收款|批量|支付|网银在线|银联|中国平安|中国太平洋|信托|基金|冲正|中国人寿|小额贷款|'
#                      '中金同盛|磁石供应链商业保理|晋福融资担保|孚厘|中金同盛商业保理|转支|保险|社保|二维码|备用金|备付金|'
#                      '零钱通|充值|微信红包|网转|退款|理财|缴费|他行汇入|提现|财付通|电汇|国家金库|公积金管理中心|待报解预算']

# 上下游金额上下限金额（元）
UP_DOWNSTREAM_THRESHOLD = 1000

# 同一交易账号对应多个交易对手
IGNORE_ACC_NO = ['', '0', '0.0', '1.0000000000000002e+17', '-', '99900001262112001358', '1504292651', '800075500100007']
IGNORE_ACC_NO_PATTERN = '999999.*99|105331.*0875|105584.*0061|105100.*2625|105551.*8273|1500947831|215.*690' \
                        '|210401344|105584.*|100000000000000000|243.*133|48429202|1000049901|1000107101|1000050001'
IGNORE_OPPO_NAME_PATTERN = '微信|支付宝|财付通|余额宝|滴滴出行|抖音支付|易宝支付|美团支付'

# 结息交易对手标签
# INTEREST_OPPO_KEY_WORD = '银行|利息|结息|个人活期结息|批量结息|存息|付息|存款利息|批量业务'
# 结息标签
# INTEREST_KEY_WORD = '利息|结息|个人活期结息|批量结息|存息|付息|存款利息|批量业务|入息|季息'
# 非结息标签
# NON_INTEREST_KEY_WORD = '理财|钱生钱|余额宝|零钱通|招财盈|宜人财富|保证金|透支|转账|智能|其他账户|税后|转存'

# 一、多头交易类型关键字
# 消费金融
CONSUME_FINANCE = "消金|消费金融|消费贷款|好期贷|安逸花|空手到|有钱花|微众银行|微业贷|微粒贷|融e贷|闪电贷|360借条|360还款|柚卡|好客贷|邮你贷|" \
                  "拍拍贷|好会花|轻享贷|平安智贷|信期贷|长银五八|好人贷|够花|小鱼福卡|易开花|诚e贷|捷e贷|包银消费|深圳农商行|Su贷|Su花|平安小橙花|" \
                  "小米贷款|哈哈贷|同程金服|金企贷|晋情贷|钱多美|小蓉花|鑫梦享|分期乐|白领融|盛享贷|锦囊贷|锦易贷|幸福花|畅享贷|阳光消费|港中旅财|捷信金融|" \
                  "省呗|汇旺财|消费银企|陆金所|还呗"
# 消费金融剔除关键字
CONSUME_FINANCE_EXCEPT = "退还|退回|基金申购|担保|验证"

# 微信支付宝消费金融
WXZFB_CONSUME_FINANCE = "消费金融还款"

# 融资租赁
FINANCE_LEASE = "融资租赁|国际租赁|金融租赁|仲利国际租赁|广汽租赁|租赁融资"

# 担保关键字
GUARANTEE = "担保|融担"
# 担保剔除关键字
GUARANTEE_EXCEPT = "法院"

# 保理关键字
FACTORING = "保理"

# 小贷关键字
SMALL_LOAN = "小额贷|小贷|互联网信息咨询|360借条|360网络贷款|陕银消费|人人贷|放心借"
# 小贷剔除关键字
SMALL_LOAN_EXCEPT = "小额贷记来账|信用卡|服务费"


# 银行放款交易对手关键字
BANK_LOAN_OPPONENT_NAME = "银行|个贷|贷款|放款过渡户|信贷|海信集团财务有限公司|海尔集团财务有限责任公司"
# 银行放款交易对手剔除关键字
BANK_LOAN_OPPONENT_NAME_EXCEPT = r"0|1|2|3|4|5|6|7|8|9|网上商城|/|:|：|\\"
# 银行放款备注关键字
BANK_LOAN_REMARK = "放款|贷款|信贷|放贷"
# 银行放款剔除关键字
BANK_LOAN_CONCAT_STR_EXCEPT = "贴现放款|消费|转存|POS|pos|转支|电子商务|工程|工资|验证|退回"
# 银行放款兼容关键字
BANK_LOAN_CONCAT_STR_COMPATIBLE = "消费贷"

# 微信支付宝银行放款关键字
WXZFB_BANK_LOAN = "信用卡还款"
# 微信支付宝银行放款备注剔除关键字
WXZFB_BANK_LOAN_REMARK_EXCEPT = "余利宝"

# 银行还款交易对手关键字
BANK_REPAY_OPPONENT_NAME = "银行|个贷"
# 银行还款交易对手剔除关键字
BANK_REPAY_OPPONENT_NAME_EXCEPT = r"0|1|2|3|4|5|6|7|8|9|网上商城|/|:|：|\\"
# 银行还款备注关键字
BANK_REPAY_REMARK = "放款|贷款|信贷|放贷"
# 银行还款剔除关键字
BANK_REPAY_CONCAT_STR_EXCEPT = "收单|短信服务|工资|电费|缴税|手续费|回单服务|人寿保险|管理费|服务费|信使费|ETC|POS|消费|" \
                               "转存|etc|pos|转支|代收"
# 银行还款兼容关键字
BANK_REPAY_CONCAT_STR_COMPATIBLE = "消费贷"
# 银行还款关键字
BANK_REPAY_CONCAT_STR = "还贷|自动还款|贷款利息|约定还款|贷款回收|批量代扣|约定还款|收回利息|贷款业务|批量扣款|还本金"

# 受托支付关键字
ENTRUSTED_PAY = "受托支付"

# 第三方支付关键字
THIRD_REPAY_1 = "支付宝|微信|钱袋宝|程付通|京东支付|抖音|特约|聚合支付|平安付|网银在线"
THIRD_REPAY_2 = "借|还"
THIRD_REPAY_3 = "花呗|借呗|拿去花|借去花|京东白条|京东金条|京东金融|DOU分期|抖音月付|美团月付|滴滴月付|美团生活费|美团借钱|美团生意贷|美团金融服务|亿联易贷（美团）"
# 第三方支付剔除关键字
THIRD_REPAY_EXCEPT = "信用卡|银行|还地桥"

# 其他金融关键字
OTHER_FINANCE = "信托|贷.*过渡户|过渡户.*贷|财务.*公司|资金互助社|金融.*公司|供应链融资|车贷放款|押车放款|融资作业" \
                "|租赁.*还|其他外围|陆家嘴国际金融资产交易市场|保险.*贷款"
# 其他金融剔除关键字
OTHER_FINANCE_EXCEPT = "综合金融服务平台|财务咨询|小微商户|中移动金融科技|金融[城街]|工程款|服务费|" \
                       "材料款|预付款|保证金|项目款|代理费|竞价|报价|运输款|运输费|信用卡"
# 其他金融交易对手为个人关键字
OTHER_FINANCE_PER = "车贷|还车款|汽车金融"
# 其他金融关联关系关键字
OTHER_FINANCE_RELATION = "车辆按揭"
# 其他金融交易渠道剔除关键字
OTHER_FINANCE_CHANNEL_EXCEPT = "清算中心"
# 其他金融剔除企业
OTHER_FINANCE_ENT_EXCEPT = "浙江即富金融数据处理|现代金融控股|宝付网络科技"

# 民间借贷关键字
PRIVATE_LENDING = "信贷|融资|垫款|个人.*贷|现金分期|借|还|本金|房贷|转贷|过桥|民间融资服务中心"
# 民间借贷兼容关键字
PRIVATE_LENDING_COMPATIBLE = "抵押"
# 民间借贷剔除关键字
PRIVATE_LENDING_EXCEPT_1 = \
    "贷款转存|贷记|ETC|无折借|借支|退还|返还|借记|信用卡|贴现|货款|床垫|消费|POS|钱生钱|特约|招标|退耕还林|还地桥|物流|" \
    "退本金|股本金|理财|钱生钱|余额宝|零钱通|招财盈|宜人财富|投资本金|租|工资|税|水电|工程"
PRIVATE_LENDING_EXCEPT_2 = \
    "工资|奖金|年终奖|差旅费|报销|福利费|慰问|公共缴费|租|保险|支付宝|信用卡|消费|特约|服务费|停车费|理财|钱生钱|余额宝|" \
    "零钱通|招财盈|宜人财富|投资本金|租|工资|税|水电"
PRIVATE_LENDING_EXCEPT_WX = \
    "贷款转存|贷记|ETC|无折借|借支|退还|返还|借记|信用卡|贴现|货款|床垫|消费|POS|钱生钱|特约|招标|退耕还林|还地桥|物流|" \
    "退本金|股本金|理财|钱生钱|余额宝|零钱通|招财盈|宜人财富|投资本金|租|工资|税|水电|工程|还是"
# 民间借贷付息关键字
PRIVATE_LENDING_INTEREST = "利息|结息|本息"
# 民间借贷付息剔除关键字
PRIVATE_LENDING_INTEREST_EXCEPT = "计提"
# 民间借贷交易对手剔除关键字
PRIVATE_LENDING_OPPONENT_NAME = "银行"


# 二、异常交易类型关键字
# 博彩关键字
GAMBLE = r"(彩票|博彩|竞彩|体彩|双彩|福彩|乐透)"
# 博彩进账关键字
GAMBLE_INCOME = r"(返奖|退款)"

# 娱乐不良关键字
AMUSEMENT = r"(夜总会|ktv|娱乐|洗浴|会所|足浴|休闲会所|汤泉会所|养生会所|水疗会所|按摩|足道|足艺|足部保健|修脚|SPA|沐足阁|酒吧|Club|订台|卡座)"
# 娱乐不良剔除关键字
AMUSEMENT_EXCEPT = r"(采购|投标保证金|货款|工程|加工|材料费|材料款|机械费|运费|装修|空调|配送|配货|器材|垫|椅|微不足道|baby|超市|客服|中心|车|俱乐部|馆|运动)"

# 案件纠纷关键字
CASE_DISPUTES = r"(人民法院|法律服务|律师事务所)"

# 治安罚款出账关键字
SECURITY_EXPENSE_FINES = r"(公安局|公安厅|公安部|公安分局)"
# 治安罚款关键字
SECURITY_FINES = r"(保释|罚|候审|质保)"
# 治安罚款剔除关键字
SECURITY_FINES_EXCEPT = r"(交通|交警|公安县|出入境|消防)"

# 保险理赔关键字
INSURANCE_CLAIMS = r"(理赔|赔款|赔偿款|赔付)"

# 股票期货交易对手关键字
STOCK_OPPONENT_NAME = r"(证券|期货)"
# 股票期货备注关键字
STOCK_REMARK = r"(银证|证券|银转证|证转银|期货|银期转账|银转期|期转银)"
# 股票期货剔除关键字
WXZFB_STOCK_OPPONENT_NAME_EXCEPT = r"(网商银行|救助基金会)"

# 医院关键字
HOSPITAL = r"(医院|药房|门诊|急诊|住院|卫生院|诊所|卫生服务中心|卫生服务站|卫生所|卫生室|妇幼保健院|平安健康互联网|" \
           r"医药有限公司|医师|草药医|理疗|诊断|医学检验|药业|门诊|医堂|医疗|口腔|微脉|阿里健康|平安好医生|京东健康|牙科|甘草医生)"
HOSPITAL_2 = "医药|中医"
# 医院剔除关键字
HOSPITAL_EXCEPT = r"(宠物|美容|退款|店|整形|采购|投标保证金|货款|工程|工资|加工|材料|停车|机械费|运费|装修|空调|净化|系统|划款|耗材|饭|" \
                  r"打扫|食堂|汽修|器|摆摊|批发|保险|保障|税款|往来|餐费|住宿|设备|财政|财务|科技|用品|租赁|公司|员工|工人|报销|印刷费|租车|委员会)"
HOSPITAL_EXCEPT_2 = r"大学|学校|店|饭|学院|公司|企业|批发|器|采购|保险|保障|税款|往来|餐费|住宿|设备|财政|财务|材料|耗材|科技|用品|租赁|" \
                    r"公司|员工|工人|报销|印刷费|租车|委员会"

# 直播打赏关键字
REWARD = r"(抖音短视频|抖音app|DOU+上热门|直播)"
# 直播打赏剔除关键字
REWARD_EXCEPT = r"(货|公司|店|供应链|现场|工作室|库存|代理|A|拼多多)"
# 薅羊毛关键字1
COUPON_CLIPPER_1 = r"(拼多多|拼小圈)"
# 薅羊毛关键字2
COUPON_CLIPPER_2 = r"(多多视频|多多果园|现金|多多赚大钱|红包|视频|签到|免费|奖励|领|分|摇一摇)"
# 贷款异常担保关键字
LOAN_GUAR_ABNORMAL = r"(还本|还款|还贷|本金)"
# 贷款异常关键字
LOAN_ABNORMAL = r"(逾期|罚息)"
# 贷款异常剔除关键字
LOAN_ABNORMAL_EXCEPT = r"(业务标识号)"

# 对外担保异常关键字
GUAR_ABNORMAL = r"(替.+还款|代偿)"

# 典当关键字
NORITOMO = r"(典当)"


# 三、成本支出关键字
# 工资
SALARY = r"(工资|奖金|年终奖|差旅费|报销|福利费|慰问|公共缴费)"
# 水电
UTILITIES = r"(水费|电费|国网.*电力|电力生活缴费|电力股份有限公司|电力有限公司|供电|国家电网|南方电网|水务|供水|燃气|煤气|液化气)"
UTILITIES_EXCEPT = r"(设备|电器|物资|水表|执法|制造|清洗|石油|管道|安装|检测|科技|加油站|维修|配送)"
# 税费
TAX = r"(税务|税款|财税|税费|国税|地税|缴税)"
TAX_EXCEPT = r"(耗材|厂商|考试)"
# 房租
RENT = r"(房租|租金|房东)"
#房租剔除关键字
RENT_EXCEPT = r"(药房|店)"
# 保险
INSURANCE = r"(GPIC|中国人寿|保险|中国人民财产保险|PICC|财险|产险|CPIC|平安健康险|保费|人保)"
# 可变成本
VARIABLE_COST = r"(购原材料|购买材料|材料款)"


# 四、其他画像
# 整进整出剔除关键字
BIG_IN_OUT_EXCEPT = "冲正|抹账"

# 快进快出交易对手剔除关键字
FAST_IN_OUT_OPPONENT_NAME_EXCEPT = "转账|转存|转支"
# 快进快出剔除关键字
FAST_IN_OUT_EXCEPT = "冲正|抹账"

# 家庭不稳定交易金额
FAMILY_RISK_AMT = [5.20, 5.21, 13.14, 14.13, 20.20, 20.13, 20.14, 131.4, 201.3, 201.4, 520,
                   520.20, 521, 1314, 1314.2, 1413, 1413.2, 2013.14, 2014.13, 201314, 2020.2,
                   202020.2, 13145.2, 1314520, 52013.14, 5201314]

# 理财行为进账关键字
FINANCING_INCOME = "到期|赎回|理财收益"
# 理财行为出账关键字
FINANCING_EXPENSE = "认购|买入|理财本金|理财购买"

# 房产买卖关键字
HOUSE_TRADE = "买房|卖房|首付|售房|房地产|置业|购房|认筹|房产评估费|房屋评估费|房款|房产"
HOUSE_OPPO = "有限公司"
# 房产买卖剔除关键字
HOUSE_TRADE_EXCEPT_1 = "装修|工程|施工|外墙保温|货款|消费|报销|客户转账|餐费|物业费|水费|酒店|项目|零售|顾问|销售|清偿" \
                       "|派单|营销|报广|服务费|安装|门窗|租|电费|福利|电缆|包装|制作|插座|监理|建设|超能玩宝|食品|礼包" \
                       "|车位|宣传|广告|住宿|借款|金属|维修|质保|供货|设计|采购|供应|面积差|检测|消防|咨询|买卖|电梯|土方"
# 保险缴纳关键字
INSURANCE_PAY = "保险"
INSURANCE_OPPO = "公司"

# 我行还款来源关键字
SELF_OPPO_BANK = '桂林银行'

# 我行贷款流向关键字


# 五、交易对手类型关键字
# 企业
ENT_TYPE = r"(厂|店|公司|经营部)$"
# 开头关键字
TYPE_START_1 = r"(支付宝|消费支付宝|淘宝)"
TYPE_START_2 = r"(转账|跨行转出|对私提)"
# 剔除关键字
TYPE_EXCEPT_1 = r"[^\u4e00-\u9fa5 *]|支付宝转账|支付宝代发"
TYPE_EXCEPT_2 = r"(支付宝外部商户|支付宝划账|支付宝| |消费支付宝|淘宝)"
TYPE_EXCEPT_3 = r"(转|贷|消费|自取|资金|自定义|友宝|分期|肯德基|代付|麦当劳|携程|红包|活期|房租" \
                r"|过渡|必胜客|理财|缴费|工资|特约|还款|充值|京东|星巴克|银联|拼多多|爱奇艺|采购" \
                r"|天猫|租金|提现|淘宝|\*\*|备用|撤销|花呗|借呗|余额宝|全家)|[费款税账]$"
TYPE_EXCEPT_4 = r"[财存天停大柜订百本宝网保北电放还好汇结借跨理利内其上深浙税现中微短发卡随有月油退收快取]"
# 交易对手剔除以下单位：
UNUSUAL_OPPO_NAME = ['对私|跨行|淘宝|转[账存出入取支]|[收存取付放还贷货汇]款|批量|支付|网银在线|银联|中国平安|中国太平洋|信托|基金|'
                     '冲正|中国人寿|中金同盛|磁石供应链商业保理|晋福融资担保|孚厘|中金同盛商业保理|保险|社保|二维码|备用金|备付金|'
                     '零钱通|充值|微信红包|网转|退款|理财|缴费|汇[入出兑费]|提现|财付通|电汇|国家金库|公积金管理中心|待报解预算|'
                     '信用卡|退汇|清算|结算|中间账户|内部账户|工资|消费|账户入金|代付业务专户|收单|利息|卡存|卡取|信使费|'
                     '特约百度服务|国库收付中心|业务款项|往来款|服务费|划拨|抹帐|代发|小额|扣息|分红|生意贷|银行|监管|社会保障|'
                     '垫资|营销|空|现金|收费|业务|明细|分付|平台商户|扣税|头寸户']

# 结息交易对手标签
INTEREST_OPPO_KEY_WORD = '银行|利息|结息|个人活期结息|批量结息|存息|付息|存款利息|批量业务'
# 结息标签
INTEREST_KEY_WORD = '利息|结息|个人活期结息|批量结息|存息|付息|存款利息|批量业务|入息|季息|收息|interest|INTEREST'
# 非结息标签
NON_INTEREST_KEY_WORD = '理财|钱生钱|余额宝|零钱通|招财盈|宜人财富|保证金|透支|智能|其他账户|税后|转存|贷款'

# 最小民间借贷金额
MIN_PRIVATE_LENDING = 500
# 最小民间借贷持续月份数
MIN_CONTI_MONTHS = 6
# 最大民间借贷日期差别
MAX_INTERVAL_DAYS = 5
