COLUMN_TRANSFORM_BACK = {
    'relationship': {
        '本人互转': 'U_PERSONAL',
        '配偶关联': 'U_PER_SP_PERSONAL',
        '其他个人关联': 'U_PER_PARTNER_PERSONAL',
        '实控企业关联': 'U_PER_CT_COMPANY',
        '其他企业关联': 'U_PER_SH_H_COMPANY',
        '担保个人': 'U_PER_GUARANTOR_PERSONAL',
        '担保企业': 'U_PER_GUARANTOR_COMPANY'
    },
    'loan_type': {
        "消金": "消金",
        "融资租赁": "融资租赁",
        "担保": "担保",
        "保理": "保理",
        "小贷": "小贷",
        "银行": "银行",
        "第三方支付": "第三方支付",
        "其他金融": "其他金融",
        "民间借贷": "民间借贷"
    },
    'unusual_trans_type': {
        "博彩": "博彩",
        "娱乐": "娱乐",
        "案件纠纷": "案件纠纷",
        "治安罚款": "治安罚款",
        "保险理赔": "保险理赔",
        "股票期货": "股票期货",
        "医院": "医院",
        "贷款异常": "贷款异常",
        "对外担保异常": "对外担保异常",
        "典当": "典当"
    },
    'usual_trans_type': {
        "整进整出": "整进整出",
        "快进快出": "快进快出",
        "家庭不稳定": "家庭不稳定"
    },
    'cost_type': {
        "工资": "工资",
        "水电": "水电",
        "税费": "税费",
        "房租": "房租",
        "保险": "保险",
        "可变成本": "可变成本"
    }
}

